---
type: IUpdater
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# IUpdater

`Autodesk.Revit.DB.IUpdater` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Execute | 2011 | `void Execute ( UpdaterData data )` |
| Method | GetAdditionalInformation | 2011 | `string GetAdditionalInformation ()` |
| Method | GetChangePriority | 2011 | `ChangePriority GetChangePriority ()` |
| Method | GetUpdaterId | 2011 | `UpdaterId GetUpdaterId ()` |
| Method | GetUpdaterName | 2011 | `string GetUpdaterName ()` |